{
    "inpainted_folder": "Folder containing the inpainted videos. The tool will look for files ending in '_inpainted_right_eye.mp4' or '_inpainted_sbs.mp4'.",
    "original_folder": "Folder containing the original 2D source videos. This is required for dual-splatted inputs to provide the left-eye view.",
    "mask_folder": "Folder containing the high-resolution splatted files (e.g., '_splatted4.mp4' or '_splatted2.mp4') which contain the mask and warped background.",
    "output_folder": "Folder where the final merged videos will be saved.",

    "binarize_thresh_(<0=off)": "Converts the grayscale mask to pure black and white before other processing. Values of 0.0 or higher act as the threshold. Set to a negative value (e.g., -0.01) to disable and use the original grayscale mask.",
    "dilate_kernel": "Expands the white areas of the mask. Useful for covering up thin black lines at the edge of the inpainted region. Set to 0 to disable.",
    "blur_kernel": "Applies a Gaussian blur to the mask, creating a softer, more feathered blend between the original and inpainted content. Set to 0 to disable.",
    "shadow_shift": "The number of pixels to shift the 'shadow' to the right in each step of the shadow blur effect. Set to 0 to disable.",
    "shadow_gamma": "Controls the fade-out curve of the shadow. >1.0 starts slow and fades fast. <1.0 starts fast and fades slow. 1.0 is a linear fade.",
    "shadow_opacity_start": "The starting opacity of the first shadow 'echo'. A value of 1.0 is fully opaque.",
    "shadow_opacity_decay": "The amount of opacity to subtract from the shadow at each step. A larger value creates a shorter, faster fade.",
    "shadow_opacity_min": "The opacity at which the shadow effect will stop generating new echoes.",

    "output_format": "Selects the 3D format for the final video. Full SBS is highest quality. Half SBS is more compatible but lower resolution. Double SBS is a vertically stretched format for some 3D displays. Anaglyph is for Red/Cyan glasses.",
    "use_gpu": "If checked, mask processing will be performed on the GPU for speed. Uncheck to use the CPU, which is slower but uses very little VRAM.",
    "pad_to_16_9": "If checked, adds black bars to the top and bottom of the video to force a 16:9 aspect ratio. Useful for non-standard resolutions (e.g., 1920x800) to ensure compatibility with 3D players.",
    "enable_color_transfer": "Transfers the color palette from the original left-eye view to the inpainted right-eye view to correct color shifts from the inpainting model.",
    "batch_chunk_size": "The number of frames to process in memory at one time during batch processing. Lower this value if you run out of RAM on long videos.",

    "start_blending": "Starts the batch process to merge all found videos using the current settings.",
    "stop_blending": "Stops the batch process after the current video chunk is finished."
}